---
type: ElementParameterFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementParameterFilter

`Autodesk.Revit.DB.ElementParameterFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementParameterFilter | — | `` |
| Method | GetRules | 2011 | `public IList < FilterRule > GetRules ()` |
| Method | PassesFilter | — | `` |